Repository: PalinaSh/OSIS-Course-project
Catalog: CommandInterpreter/CommandInterpreter/Properties/Resources.*.resx
Languages: ru_ru

# AccessDenied
source: Access is denied.
ru_ru: В доступе отказано.

source: and
ru_ru: и

# Sure
source: Are you sure
ru_ru: Вы согласны

# BadSyntax
source: The syntax of the command is incorrect.
ru_ru: Некорректный синтаксис команды.

# BigPort
source: Port is too big.
ru_ru: Значение порта слишком велико.

# Chat
source: Creates UDP-chat for your secure communication
ru_ru: Создаёт UDP-чат для ваших секретных переписок

# ChatLocalport
source: Port from which messages are sent
ru_ru: Порт из которго будут отправляться сообщения

# ChatName
source: Your name in the chat
ru_ru: Ваш псевдоним в чате

# ChatRemoteport
source: Port on which messages come
ru_ru: Порт, с которого сообщения будут получаться (прослушиваться)

# Clear
source: Clears the screen
ru_ru: Очищает экран консоли

# Color
source: Sets the default console foreground and background colors
ru_ru: Устанавливает цвет фона и\или шрифта консоли

# ColorBackground
source: Specifies color of console background
ru_ru: Определяет цвет фона консоли

# ColorForeground
source: Specifies color of console foreground
ru_ru: Определяет цвет символов консоли

# Compact
source: Creates .zip archive of files
ru_ru: Создаёт .zip архив

# CompactDirectory
source: Path to the directory which will be the archive
ru_ru: Путь к директории, которая будет заархивирована

# CompactFilename
source: Paths to files to be added to the archive
ru_ru: Путь к файлам, которые будут добавлены в архив

source: Comparing
ru_ru: Сравнение

# Copy
source: Copies one file to another location
ru_ru: Копирует некоторый файл в другую локацию

# CopyDstFilename
source: Path to the new file
ru_ru: Путь к расположению скопированного файла

# CopySourceFilename
source: Path to file to be copied
ru_ru: Путь к файлу, который будет скопирован

source: Could Not Find
ru_ru: Не найден

# CountCopiedFiles
source: file(s) copied.
ru_ru: файл(ов) скопирован(о).

# CountMovedFiles
source: file(s) moved.
ru_ru: файл(ов) перемещен(о).

# Create
source: Creates files
ru_ru: Создаёт новые файлы

# Createdir
source: Creates directories
ru_ru: Создаёт новые директории

# CreateDirname
source: Paths to directories to be added
ru_ru: Имена новых директорий (пути к ним)

# CreateFilename
source: Paths to new files to be added
ru_ru: Имена новых файлов (пути к ним)

# CurrentDate
source: The current date is:
ru_ru: Текущая дата:

# Date
source: Displays the date
ru_ru: Выводит дату

# Decompact
source: Extract .zip file to directory
ru_ru: Извлекает содержимое из .zip архива

# DecompactDirname
source: Path to the directory in which extract file
ru_ru: Путь к директории, в которую будет извлечено содержимое архива

# DecompactFilename
source: Path to .zip file to be extarct
ru_ru: Путь к .zip файлу, из которого будет извлекаться содержимое

# Delete
source: Deletes one or more files
ru_ru: Удаляет один или несколько файлов

# DidNotFindPart
source: Didn't find part of the path:
ru_ru: Не найдна часть пути:

# DiffrentSizes
source: Files are different sizes.
ru_ru: Файлы имеют различные размеры.

# Directory
source: Directory of
ru_ru: Директория

# DirectoryNotEmpty
source: The directory is not empty.
ru_ru: Директория не пуста.

# ErrorCompareLine
source: Compare error at LINE
ru_ru: Ошибка савнения файлов ЛИНИЯ

# ErrorCompareOffset
source: Compare error at OFFSET
ru_ru: Ошибка сравнения файлов СМЕЩЕНИЕ

# Exit
source: Quits the CommandInterpreter.EXE program (or chat)
ru_ru: Завершает выполнение программы CommandInterpreter.exe (или чата)

# Fc
source: Compares the contents of two files
ru_ru: Сравнивает содержимое двух файлов

# FcAscii
source: Displays differences in ASCII characters
ru_ru: Выводит разницу в символах ASCII

# FcCase
source: Disregards case of ASCII letters when comparing files
ru_ru: Сравнивает ASCII символы файлов без учёта их регистра

# FcDecimal
source: Displays differences in decimal format
ru_ru: Выводит разницу в десятичном формате

# FcFirst
source: Specifies location and name of first file to compare
ru_ru: Определяет путь к первому файлу для сравнения

# FcLine
source: Displays line numbers for differences
ru_ru: Выводит номер строки, в которой были найдены различия

# FcNumber
source: Compares only the first specified number of lines in each file
ru_ru: Сравнивает только указанное количество строк файлов

# FcSecond
source: Specifies location and name of second file to compare
ru_ru: Определяет путь ко второму файлу для сравнения

# FileCannotCopied
source: The file cannot be copied onto itself.
ru_ru: Файл не может быть скопирован сам в себя.

# Goto
source: Displays the name of or changes the current directory
ru_ru: Выводит имя или изменяет текущую директорию

# GotoDirectory
source: Canges current directory
ru_ru: Изменяет текущую директорию

# Help
source: Provides Help information for commands
ru_ru: Выводит информацию о командах интерепретатора

# HelpCommand
source: Displays help information on that command
ru_ru: Выводит информацию о введённой команде

# IncorrectCommand
source: is not recognized as an internal or external command.
ru_ru: не распознается как внутренняя или внешняя команда.

# IncorrectFile
source: Can't find/open file:
ru_ru: Невозможно найти\открыть файл:

# IncorrectLocalPort
source: Local port is incorrect.
ru_ru: Некорретное значени локального порта.

# IncorrectPath
source: The system cannot find the path specified.
ru_ru: Система не может найти указанный путь.

# IncorrectRemotePort
source: Remote port is incorrect.
ru_ru: Некорретное значени прослушиваемого порта.

# InvalidColor
source: Colors is not valid
ru_ru: Некорректное значение цвета.

# InvalidDirname
source: The directory name is invalid.
ru_ru: Некорректное имя директории.

# Join
source: joined chat.
ru_ru: присоединился к чату.

# Left
source: lefted chat
ru_ru: покинул чат.

# Move
source: Moves one or more files from one directory to another directory
ru_ru: Премещает один или несколько файлов из одной директории в другую

# MoveDirname
source: Path to the directory in which move files
ru_ru: Путь к директории, в которую будут перемещены файлы

# MoveFilename
source: Paths to files to be moved
ru_ru: Пути к файлам, которые будут перемещены

# NameFirstFile
source: Name of first file to compare:
ru_ru: Имя первого файла для сравнения:

# NameSecondFile
source: Name of second file to compare:
ru_ru: Имя второго файла для сравнения:

# NotArchive
source: is not archive.
ru_ru: не является архивом.

# OkCompare
source: Files compare OK.
ru_ru: Сравнение файлов успешно - содержимое одинаково.

source: Overwrite
ru_ru: Разрешить перезапись

# Removedir
source: Removes a directory
ru_ru: Удаляет директорию

# RemoveDirname
source: Path to the removed directory
ru_ru: Путь к удаляемой директории

# RemovedirRecursive
source: Removes all directories and files in the specified directory in addition to the directory itself
ru_ru: Удаляет все дочерние файлы и директории удаляемой директории рекурсивно

# RequiredDstDir
source: Name of destination directory is required.
ru_ru: Требуется имя каталога назначения.

# RequiredLocalPort
source: Local port is required argument.
ru_ru: Значение локального порта - обязательный аргумент.

# RequiredRemotePort
source: Remote port is required argument
ru_ru: Значени прослушивоемого порта - обязательный аргумент.

# Show
source: Displays a list of files and subdirectories in a directory
ru_ru: Выводит содержимое директории

# ShowAttributes
source: Displays files with specified attributes
ru_ru: Выводит файлы с некторыми атрибутами

# ShowCreated
source: Displays date of file and directories created
ru_ru: Выводит даты создания файлов и директории

# ShowDirname
source: Path to the directory
ru_ru: Путь к файлу

# ShowSize
source: Displays files' sizes
ru_ru: Выводит размеры файлов (в байтах)

# Title
source: Sets the window title for a CommandInterpreter.EXE session
ru_ru: Устанавливает заголовок консольного приложения на один сеанс

# TitleTitle
source: Specifies the title for the command prompt window
ru_ru: Определяет заголовок консоли

# TryHelp
source: Try HELP for more information.
ru_ru: Вызовите команду HELP для большей информации.

# Whoami
source: Displays current user's name
ru_ru: Выводит имя текущего пользователя

# YetExists
source: File yet exists in this directory.
ru_ru: Файл уже существует в этой директории.

# ChatDescr
source: Local chat created using a UDP connection. Join yourself and call your friends.
ru_ru: Локальный чат, созданный с использованием UDP соединения. Присоединяйся к чату и зови своих друзей.

# ColorDescr
source: Console support colors:
ru_ru: Консоль поддерживает следующие цвета:

# CompactDescr
source: All parameters is required. For multiple files/directories used syntax:
ru_ru: Все параметры являются обязательными. При множественном выборе используется следующий синтаксис:

# CopyDescr
source: All parameters is required
ru_ru: Все параметры являются обязательными

# DateDescr
source: Type DATE to display the current date
ru_ru: DATE выводит текущую дату и время с точностю до секунд

# DecompactDescr
source: All parameters is required. sourceFilename must ends with '.zip'
ru_ru: Все параметры являются обязательными. sourcefilename должен оканчиваться на '.zip'

# FcDescr
source: To compare sets of files, use wildcards in filename1 and filename2 parameters. Files must be in text-format.
ru_ru: Чтобы сравнить наборы файлов, используйте подстановочные знаки в параметрах filename1 и filename2. Файлы должны быть в текстовом формате.

# GotoDescr
source: Type GOTO without parameters to display the current drive and directory.
ru_ru: Введите GOTO без параметров для отображения текущего диска и каталога.\nИспользуйте ключ / D для изменения текущего диска в дополнение к изменению текущего каталога для диска.\n .. Указывает, что вы хотите перейти в родительский каталог.

# RemovedirDescr
source: If directory is not empty and you want to delete it use 'recursive'-deleting.
ru_ru: Если каталог не пустой и вы хотите удалить его, используйте 'recursive'-рекурсивное удаление.

# ShowDescr
source: You can use attributes (attr1,attr2,attr3)
ru_ru: Вы можете использовать атрибуты (attr1, attr2, attr3)\n\tD Каталоги\n\tH Скрытые файлы и каталоги\n\tR Файлы и каталоги только для чтения\n\tS Системные файлы и каталоги\n

# ForMoreInfo
source: For more information on a specific command, type HELP command-name
ru_ru: Для получения дополнительной информации о конкретной команде введите HELP <имя_команды>

# Lang
source: Changes language of your console to Russian or English
ru_ru: Меняет язык вашей консоли на русский или английский
